{"faculty":[{"name":"Brent Hecht","link":"http://www.brenthecht.com/","image":"/static/brent1.jpg"}],"gradStudents":[{"name":"Allen Lin","link":"http://users.eecs.northwestern.edu/~ylo3469/","image":"/static/allen1.jpg"},{"name":"Isaac Johnson","link":"http:/www.isaacjoh.com","image":"/static/isaac1.jpg"},{"name":"Hanlin Li","link":"http://www.lihanlin.com","image":"/static/hanlin1.jpg"},{"name":"Nick Vincent","link":"http://www.nickmvincent.com","image":"/static/nick_vincents_face.jpg"}],"undergradStudents":[{"name":"Bodhi Alarcon"},{"name":"Patrick Sheehan"},{"name":"Rainy Che"},{"name":"Sara Milkes"}],"collaborators":[{"name":"HCI Bremen @ University of Bremen","link":"http://hci.uni-bremen.de/"},{"name":"Collablab @ Northwestern University","link":"http://collablab.northwestern.edu/"}],"about":"\nThe People, Space, and Algorithms (PSA) Research Group is a lab at Northwestern University. Our goal is to ensure that computing has a net positive impact on the world, and our research typically lies at the intersection of social computing, spatial computing, and human-computer interaction. We have particular expertise in understanding the relationships between algorithms and society and in building technologies to improve those relationships.\n","news":["Jan 2018: Allen and Isaac head off to research internships at Microsoft and Google, respectively.","Dec 2017: New WWW paper accepted.","Dec 2017: Three new ACM SIGCHI papers accepted.","Sept 2017: Nick and Hanlin formally join us as Ph.D. students!","Aug 2017: Two new ACM CSCW papers accepted.","June 2017: Brent selected as Chair of ACM Future of Computing Academy"],"projects":[{"name":"Tweet Geolocation","image":"/static/geolocation.png","description":"Bias in social-media-based algorithms derives not just from population biases in the underlying data but also from structural biases in the design of algorithms."},{"name":"Routing Algorithmic Externalities","image":"/static/routing_externalities.png","description":"Changes to fastest-path vehicle routing (e.g. incorporating notions of scenic-ness, safety, or simplicity) could have unintended side-effects both individually on the routes and in aggregate on neighborhoods."},{"name":"Death by GPS","image":"/static/deathbygps.png","description":"Driving accidents attributed to problems with GPS navigation derive from a wide variety of sources such as the failure to recognize driver context in suggesting routes and map-matching algorithms."}],"opportunitiesText":"\nWe are currently looking for students excited about doing work at the intersection of human-computer interaction, spatial computing, and social computing. Undergraduate and graduate students who would like to join PSA Research should feel free to e-mail Brent directly. Please include a little bit about yourself (e.g., CV/resume, any past research experience, skills) and something about your research interests."}